/*
Додаткове завдання
Розклад студентів на тиждень (Тривимірний масив)
Сюжет: Університетська система розкладу для 3 груп на 5 навчальних днів по 4 пари на день.
Завдання:
Опишіть масив розмірністю [3][5][4] (Групи × Дні × Пари), де зберігаються назви предметів (або "Вільне вікно").
Знайдіть день із найбільшим навантаженням (найбільшою кількістю пар) для обраної групи.
Знайдіть день із незручним розкладом (день, де в розкладі є «вікна»)
Перевірте, чи є в розкладі заняття для “потоку (коли заняття з одного предмету відбуваються в кількох групах в один і той самий час).
 */

package PracticalTwo;

import java.util.Scanner;

public class bonus {

    static final int GROUPS = 3;
    static final int DAYS = 5;
    static final int LESSONS = 4;
    static final String FREE = "Вільне вікно";

    static final String[] DAY_NAMES = {"Понеділок", "Вівторок", "Середа", "Четвер", "П'ятниця"};

    public static void main(String[] args) {
        String[][][] schedule = new String[GROUPS][DAYS][LESSONS];


        schedule[0][2] = new String[]{"Програмування", "Програмування", "Математика", FREE};
        schedule[0][3] = new String[]{FREE, FREE, FREE, FREE};
        schedule[1][3] = new String[]{"Англійська", "Математика", "Програмування", "Фізика"};
    }
}
